sulaolab/sonora-ak-nano/src/app/hal_spi_i2s_tdm/nora_spi_i2s_tdm_dspic33ak_hw.c

//===========================================================
// INCLUDES
//===========================================================
#include <xc.h>
#include <stdint.h>
#include <stdbool.h>
#include <stddef.h>
#include "nora_dma.h"               // DMA channel config/enable
#include "nora_spi_i2s_tdm_dspic33ak_reg.h"   // SPI framed-mode register masks (XC-DSC-free)
#include "nora_spi_i2s_tdm_dspic33ak_hw.h"


//===========================================================
// Definition
//===========================================================

// ---- Debug master switch (silicon layer) ----
// Default OFF: compiles with no printf dependency. Define ENA_TDM_DBG (here or via the
// build configuration) to restore the DMA-config error printf (TDM_DBG_PRINTF -> printf
// when ON, no-op when OFF).
//#define ENA_TDM_DBG

#if defined(ENA_TDM_DBG)
  #include <stdio.h>                 // printf (debug build only; DMA-config error prints)
  #define TDM_DBG_PRINTF(...)   printf(__VA_ARGS__)
#else
  #define TDM_DBG_PRINTF(...)   ((void)0)
#endif //defined(ENA_TDM_DBG)

/* PRIO_TDM_DMA now lives in nora_spi_i2s_tdm_dspic33ak_hw.h (two TUs need it). */


//===========================================================
// Enum & Struct typedef (silicon facts)
//===========================================================
typedef struct {
    volatile void     *spi_buf;     // &SPIxBUF
    volatile uint32_t *con1;        // &SPIxCON1
    volatile uint32_t *stat;        // &SPIxSTAT (sticky error/health flags: SPIROV/SPITUR/FRMERR)
    volatile uint32_t *brg;         // &SPIxBRG
    volatile uint32_t *imsk;        // &SPIxIMSK
    nora_dma_trigger_t rx_trigger;  // logical DMA event for SPIxRX
    nora_dma_trigger_t tx_trigger;  // logical DMA event for SPIxTX
} tdm_spi_dev_t;
// NOTE: the CPU RX/TX interrupt flag and enable bits are deliberately not in this
// table.  They live in IFSx/IECx, shared by every peripheral - on AK512 the same
// IEC2 byte carries SPI3/SPI4 enables next to DMA0/1/2IE - so writing them through
// a register pointer + runtime mask is a read-modify-write that can undo a bit
// another interrupt changed in between.  hw_spi_irq_bits_* below write the DFP bit
// aliases instead, which also removes the AK128 IEC1/IEC2 bank straddle from this
// table.


//===========================================================
// Function Prototype (private)
//===========================================================
static bool        hw_inst_valid( tdm_spi_inst_t inst );
static bool        hw_dma_config_channel( tdm_spi_inst_t inst, nora_dma_channel_t dma_ch, int32_t *buffer, uint32_t count, bool is_rx, uint8_t irq_priority );
static void        hw_spi_irq_enable( tdm_spi_inst_t inst, bool enable );
static void        hw_spi_irq_bits_enable( tdm_spi_inst_t inst, bool enable );
static void        hw_spi_irq_bits_clear_flags( tdm_spi_inst_t inst );
static void        hw_spi_irq_disable_clear( tdm_spi_inst_t inst );


//===========================================================
// Variables
//===========================================================

// DEVICE FACTS - data sheet transcription only (no driver/allocation values).
// Indexed by tdm_spi_inst_t. The driver's channel/buffer ALLOCATION lives in the
// transport core (s_spi_legs[]); the core passes the relevant fields down here.
static const tdm_spi_dev_t s_spi_dev[] =
{
#if NORA_SPI_I2S_TDM_DSPIC33AK_DEVICE == NORA_SPI_I2S_TDM_DSPIC33AK_DEV_AK512
    // CHSEL[7:0] values below are transcribed from the data sheet: search for
    // "Table 13-2. DMA Channel Trigger Sources" in the dsPIC33AK512MPS512
    // Family Data Sheet (DS70005591C) -> SPInRx / SPInTx rows.
    [TDM_SPI1] =
    {
        (volatile void *)&SPI1BUF, &SPI1CON1, &SPI1STAT, &SPI1BRG, &SPI1IMSK, NORA_DMA_TRIGGER_SPI1_RX, NORA_DMA_TRIGGER_SPI1_TX,
    },
    [TDM_SPI2] =
    {
        (volatile void *)&SPI2BUF, &SPI2CON1, &SPI2STAT, &SPI2BRG, &SPI2IMSK, NORA_DMA_TRIGGER_SPI2_RX, NORA_DMA_TRIGGER_SPI2_TX,
    },
    [TDM_SPI3] =
    {
        (volatile void *)&SPI3BUF, &SPI3CON1, &SPI3STAT, &SPI3BRG, &SPI3IMSK, NORA_DMA_TRIGGER_SPI3_RX, NORA_DMA_TRIGGER_SPI3_TX,
    },
    [TDM_SPI4] =
    {
        (volatile void *)&SPI4BUF, &SPI4CON1, &SPI4STAT, &SPI4BRG, &SPI4IMSK, NORA_DMA_TRIGGER_SPI4_RX, NORA_DMA_TRIGGER_SPI4_TX,
    },
#elif NORA_SPI_I2S_TDM_DSPIC33AK_DEVICE == NORA_SPI_I2S_TDM_DSPIC33AK_DEV_AK128
    // CHSEL[7:0] values below are transcribed from the data sheet: search for
    // "Table 13-2. DMA Channel Trigger Sources" in the dsPIC33AK128MC106
    // Family Data Sheet (DS70005539C) -> SPInRx / SPInTx rows.
    // (SPI1-3 only; CHSEL 0xC-0xE are Reserved -> no SPI4 on this device.)
    [TDM_SPI1] =
    {
        (volatile void *)&SPI1BUF, &SPI1CON1, &SPI1STAT, &SPI1BRG, &SPI1IMSK, NORA_DMA_TRIGGER_SPI1_RX, NORA_DMA_TRIGGER_SPI1_TX,
    },
    [TDM_SPI2] =
    {
        (volatile void *)&SPI2BUF, &SPI2CON1, &SPI2STAT, &SPI2BRG, &SPI2IMSK, NORA_DMA_TRIGGER_SPI2_RX, NORA_DMA_TRIGGER_SPI2_TX,
    },
    [TDM_SPI3] =
    {
        (volatile void *)&SPI3BUF, &SPI3CON1, &SPI3STAT, &SPI3BRG, &SPI3IMSK, NORA_DMA_TRIGGER_SPI3_RX, NORA_DMA_TRIGGER_SPI3_TX,
    },
#elif NORA_SPI_I2S_TDM_DSPIC33AK_DEVICE == NORA_SPI_I2S_TDM_DSPIC33AK_DEV_AK506
    /* MPS506 uses the same SPI1 DMA trigger pair as the MP-family MPS512.
     * Nano bring-up intentionally instantiates only this one physical leg. */
    [TDM_SPI1] =
    {
        (volatile void *)&SPI1BUF, &SPI1CON1, &SPI1STAT, &SPI1BRG, &SPI1IMSK, NORA_DMA_TRIGGER_SPI1_RX, NORA_DMA_TRIGGER_SPI1_TX,
    },
#endif
};


//===========================================================
// Global Function (silicon operations)
//===========================================================

/*
 * Program SPI framed-mode registers for one physical SPI instance.
 *
 * Writes SPIxCON1/SPIxBRG from the already-validated config and leaves DMA trigger
 * events disabled. Audio mode is intentionally off; the HAL implements I2S/TDM using
 * framed SPI plus DMA.
 */
void nora_spi_i2s_tdm_hw_apply_config( tdm_spi_inst_t inst,
                                            const nora_spi_i2s_tdm_config_t* cfg )
{
    if( !hw_inst_valid( inst ) || ( cfg == NULL ) )
    {
        return;
    }

    const tdm_spi_dev_t *dev = &s_spi_dev[inst];
    volatile uint32_t *con1 = dev->con1;

    *con1 = 0;    // just in case.
                  // note: SPI frame-sync mode, NOT Audio mode.
                  // Implement I2S/TDM with standard SPI + DMA (AUDEN = 0).

    nora_spi_i2s_tdm_reg_clear(con1, NORA_SPI_I2S_TDM_CON1_AUDEN);    // AUDEN=0 : Audio mode off
    nora_spi_i2s_tdm_reg_set  (con1, NORA_SPI_I2S_TDM_CON1_FRMEN);    // FRMEN=1 : framed SPI (SSx = FSYNC)

    // FS waveform shape -> FRMSYPW (pulse width) + fs_words (FRMCNT cadence). The public API
    // is the INTENT (fs_shape); the mapping to silicon lives here:
    //   FS_PULSE          : FRMSYPW=0 (1-BCLK short sync), one pulse per frame (fs_words=slots).
    //   FS_50PCT + I2S    : FRMSYPW=1 (a one-word pulse IS 50% of a 2-word frame), per frame.
    //   FS_50PCT + TDM    : FRMSYPW=0 + a HALF-frame marker (fs_words=slots/2); CLC10 toggles
    //                       it into a 50%-duty FS on the FS pin (engaged by the core, master
    //                       only). The DMA/buffer geometry stays sized by slots_per_fs.
    const bool fs_50pct  = ( cfg->fs_shape == NORA_SPI_I2S_TDM_FS_50PCT );
    const bool is_i2s    = ( cfg->format   == NORA_SPI_I2S_TDM_FORMAT_I2S );
    const bool is_master = ( cfg->clock_role     == NORA_SPI_I2S_TDM_CLOCK_MASTER );
    bool    frmsypw;
    uint8_t fs_words;
    if( fs_50pct && is_i2s )
    {
        frmsypw  = true;                       // one word wide == 50% of the 2-word I2S frame
        fs_words = cfg->slots_per_fs;
    }
    else if( fs_50pct && is_master )            // FS_50PCT + TDM MASTER: half-frame marker for CLC10
    {
        frmsypw  = false;                      // 1-BCLK marker (CLC10 makes the 50% duty)
        fs_words = (uint8_t)(cfg->slots_per_fs / 2u);
    }
    else                                        // FS_PULSE (any), or a TDM FS_50PCT SLAVE.
    {                                           // (An I2S FS_50PCT leg -- master OR slave -- took
        frmsypw  = false;                      //  the first branch: FRMSYPW=1. A TDM slave receives
        fs_words = cfg->slots_per_fs;          //  FS as an input; the CLC 50% marker is master-only,
    }                                           //  so no half-frame FRMCNT here.)
    nora_spi_i2s_tdm_reg_set_or_clear(con1, NORA_SPI_I2S_TDM_CON1_FRMSYPW, frmsypw);

    // IGNROV and IGNTUR are BOTH HARD-FORCED to 1 (not caller-selectable -- the config struct
    // deliberately omits both). If a FIFO flag becomes a critical-stop condition, it can suspend
    // the SPI leg and turn a primary DMA service failure into a permanent callback stall. Keeping
    // IGNROV/IGNTUR set is therefore continuity/secondary-fault containment, not an assertion that
    // lost data is benign. The primary cause is observed directly as DMAxSTAT.OVERRUN (dov=); the
    // downstream SPIROV/SPITUR and independent FRMERR effects remain visible as rov=/tur=/frm=.
    nora_spi_i2s_tdm_reg_set_or_clear(con1, NORA_SPI_I2S_TDM_CON1_IGNROV, true);
    nora_spi_i2s_tdm_reg_set_or_clear(con1, NORA_SPI_I2S_TDM_CON1_IGNTUR, true);

    // DISSDI/DISSDO/DISSCK left 0 = pins controlled by the module (already 0 after clear).

