sulaolab/sonora-ak-nano/src/app/hal_spi_i2s_tdm/nora_spi_i2s_tdm_dspic33ak_hw.c
    // MODE32=1, MODE16=0 -> 32-bit.
    //   MODE32 MODE16 AUDEN  Communication
    //   1      x      0      32-bit
    //   0      1      0      16-bit
    //   0      0      0      8-bit
    //   (AUDEN=1 combinations select Audio mode; unused here.)
    nora_spi_i2s_tdm_reg_set_or_clear(con1, NORA_SPI_I2S_TDM_CON1_MODE32, cfg->word_bits == 32u);  // MODE16 stays 0
    nora_spi_i2s_tdm_reg_set_or_clear(con1, NORA_SPI_I2S_TDM_CON1_MCLKEN, cfg->mclk_enable);       // 1: CLKGEN9 / 0: std peripheral clock

    if( cfg->clock_role == NORA_SPI_I2S_TDM_CLOCK_MASTER )
    {
        nora_spi_i2s_tdm_reg_set  (con1, NORA_SPI_I2S_TDM_CON1_MSTEN);    // MSTEN=1 : Host
        nora_spi_i2s_tdm_reg_clear(con1, NORA_SPI_I2S_TDM_CON1_FRMSYNC);  // FRMSYNC=0 : FS output (host)
    }
    else
    {
        // MSTEN=0 : Client (already 0).  FRMSYNC=1 : FS input (client)
        nora_spi_i2s_tdm_reg_set  (con1, NORA_SPI_I2S_TDM_CON1_FRMSYNC);
    }

    // FRMPOL: 1 = FS/CS active-high, 0 = active-low. Convention: I2S active-low,
    // TDM active-high.
    nora_spi_i2s_tdm_reg_set_or_clear( con1, NORA_SPI_I2S_TDM_CON1_FRMPOL,
                                            cfg->format != NORA_SPI_I2S_TDM_FORMAT_I2S );

    // FRMCNT: FS pulse every N words (N = fs_words computed above). Encoding = log2(N):
    //   000 each word / 001 every 2 / 010 every 4 / 011 every 8 / 100 every 16 / 101 every 32.
    // So per-frame: I2S(2)->1, TDM4->2, TDM8->3, TDM16->4, TDM32->5; the FS_50PCT+TDM
    // half-frame marker halves N (TDM8->every 4 words->2, etc.). Defaults to TDM8 framing.
    uint32_t frmcnt;
    switch( fs_words )
    {
    case 1u:  frmcnt = 0u; break;
    case 2u:  frmcnt = 1u; break;
    case 4u:  frmcnt = 2u; break;
    case 8u:  frmcnt = 3u; break;
    case 16u: frmcnt = 4u; break;
    case 32u: frmcnt = 5u; break;
    default:  frmcnt = 3u; break;
    }
    nora_spi_i2s_tdm_reg_write_field( con1, NORA_SPI_I2S_TDM_CON1_FRMCNT_MASK,
                                           NORA_SPI_I2S_TDM_CON1_FRMCNT_POS, frmcnt );

    // SPIFE: 0 = FS edge precedes first BCLK (1-bit delayed) / 1 = coincides (no delay)
    nora_spi_i2s_tdm_reg_set_or_clear(con1, NORA_SPI_I2S_TDM_CON1_SPIFE, cfg->fs_coincides_first_bclk);  // 1: no delay / 0: 1-bit delayed

    // ---- BCLK phase: CKP / CKE ----
    // (see Figure 23-9 "SPI Master Mode Operation in 8-bit Mode" in DS61106G.)
    //   CKP (BCLK polarity / idle level):
    //     0: idle Low , active High -> Idle->Active = rising,  Active->Idle = falling
    //     1: idle High, active Low  -> Idle->Active = falling, Active->Idle = rising
    //   CKE (transmit edge):
    //     0: transmit on Idle->Active edge
    //     1: transmit on Active->Idle edge
    //
    //     CKP CKE  Clock idle  Data changes on  Sample on
    //     0   0    Low         Rising           Falling
    //     0   1    Low         Falling          Rising
    //     1   0    High        Falling          Rising
    //     1   1    High        Rising           Falling
    //
    //   Typical I2S (Philips): data changes on BCLK falling, sampled on rising.
    //   This driver uses CKP=1, CKE=0 (idle High; data changes on the falling edge).
    nora_spi_i2s_tdm_reg_set_or_clear(con1, NORA_SPI_I2S_TDM_CON1_CKP, cfg->bclk_idle_high);                 // CKP : 1=idle High
    nora_spi_i2s_tdm_reg_set_or_clear(con1, NORA_SPI_I2S_TDM_CON1_CKE, cfg->bclk_change_on_active_to_idle);  // CKE : 1=transmit on active->idle

    // baud rate (ignored when Client / MSTEN=0)
    *dev->brg = cfg->brg;

    // Keep DMA-trigger events disabled until every SPI instance has its registers
    // programmed. The caller enables events explicitly after all register config.
    nora_spi_i2s_tdm_hw_dma_trigger_enable( inst, false );

    // SPI CPU interrupts are unused (DMA consumes the peripheral status flags).
    hw_spi_irq_disable_clear( inst );
}


/*
 * Configure + enable both DMA channels for one SPI instance.
 *
 * RX is configured first, then TX. A false return means the caller must roll back all
 * TDM DMA/SPI state because the channels may be only partially armed.
 */
bool nora_spi_i2s_tdm_hw_dma_config( tdm_spi_inst_t inst,
                                          uint8_t  rx_dma_ch,
                                          uint8_t  tx_dma_ch,
                                          int32_t* rx_buffer,
                                          int32_t* tx_buffer,
                                          uint32_t buffer_word_count,
                                          uint8_t  irq_priority )
{
    if( !hw_inst_valid( inst ) )
    {
        return false;
    }
    if( !hw_dma_config_channel( inst, rx_dma_ch, rx_buffer, buffer_word_count, true, irq_priority ) )
    {
        return false;
    }
    return hw_dma_config_channel( inst, tx_dma_ch, tx_buffer, buffer_word_count, false, irq_priority );
}


/*
 * Enable or disable SPI interrupt events used as DMA triggers.
 *
 * These are SPIxIMSK event enables, not CPU interrupt enables. The caller turns them
 * on only after every SPI instance is programmed; stop()/rollback turns them off.
 */
void nora_spi_i2s_tdm_hw_dma_trigger_enable( tdm_spi_inst_t inst, bool enable )
{
    if( !hw_inst_valid( inst ) )
    {
        return;
    }

    const tdm_spi_dev_t *dev = &s_spi_dev[inst];
    const uint32_t mask = NORA_SPI_I2S_TDM_IMSK_SPIRBFEN |
                          NORA_SPI_I2S_TDM_IMSK_SPITBEN;

    nora_spi_i2s_tdm_reg_set_or_clear( dev->imsk, mask, enable );
}


/*
 * Enable or disable one SPI module (SPIxCON1.ON only).
 *
 * The caller is responsible for ordering follower/timing legs so shared block timing
 * starts and stops cleanly.
 */
void nora_spi_i2s_tdm_hw_module_enable( tdm_spi_inst_t inst, bool enable )
{
    if( !hw_inst_valid( inst ) )
    {
        return;
    }

    const tdm_spi_dev_t *dev = &s_spi_dev[inst];
    nora_spi_i2s_tdm_reg_set_or_clear( dev->con1, NORA_SPI_I2S_TDM_CON1_ON, enable );
}


/*
 * Clear CPU RX/TX interrupt flags for one SPI instance.
 *
 * Used by stop()/rollback even though the CPU interrupts are disabled, preventing
 * stale peripheral flags from leaking into later debugging or future starts.
 */
void nora_spi_i2s_tdm_hw_irq_clear_flags( tdm_spi_inst_t inst )
{
    if( !hw_inst_valid( inst ) )
    {
        return;
    }

    hw_spi_irq_bits_clear_flags( inst );
}


