sulaolab/sonora-ak-nano/src/app/hal_spi_i2s_tdm/nora_spi_i2s_tdm_dspic33ak_hw.c
/*
 * Soft-stop one SPI instance.
 *
 * Disables DMA-trigger event generation, masks CPU SPI IRQs, and clears the SPI ON
 * bit. It does not alter PPS/CLC routing or any saved configuration.
 */
void nora_spi_i2s_tdm_hw_soft_stop( tdm_spi_inst_t inst )
{
    // Stop SPI interrupt event generation used as DMA trigger source.
    nora_spi_i2s_tdm_hw_dma_trigger_enable( inst, false );

    // SPI CPU interrupts are unused, but mask them during teardown as well.
    hw_spi_irq_enable( inst, false );

    nora_spi_i2s_tdm_hw_module_enable( inst, false );
}


/*
 * Sample this instance's SPI framed-transport health flags (SPIxSTAT) once per completed RX
 * block, and ack the ones that are software-clearable. The HAL owns these sticky bits once this
 * is called: other code reading raw SPIxSTAT afterward will see them already acked.
 *
 * SPIROV and FRMERR are R/C/HS (software-clearable) -- acked here. SPITUR is R/HSC (hardware
 * self-clearing on SPIEN=0, NOT software-clearable) and reflects a live/dynamic underrun
 * condition, so it is only OBSERVED, never written. Returns the full observed mask (all three
 * bits as read, before any clear) -- callers get SPITUR's live state either way.
 */
uint32_t nora_spi_i2s_tdm_hw_sample_ack_errflags( tdm_spi_inst_t inst )
{
    if( !hw_inst_valid( inst ) )
    {
        return 0u;
    }
    volatile uint32_t *stat = s_spi_dev[inst].stat;
    const uint32_t status = *stat;
    const uint32_t observed = status
                        & ( NORA_SPI_I2S_TDM_STAT_SPIROV
                          | NORA_SPI_I2S_TDM_STAT_SPITUR
                          | NORA_SPI_I2S_TDM_STAT_FRMERR );
    const uint32_t sw_clearable_mask = NORA_SPI_I2S_TDM_STAT_SPIROV
                                      | NORA_SPI_I2S_TDM_STAT_FRMERR;
    const uint32_t clearable = observed & sw_clearable_mask;
    if( clearable != 0u )
    {
        // W0C-safe ack: write only the software-clearable mask with the bits we just
        // observed cleared to 0. Never replay the stale `status` snapshot -- doing so
        // would risk silently clearing a flag hardware set between the read above and
        // this write (a torn write against sticky HW flags).
        *stat = sw_clearable_mask & ~clearable;
    }
    return observed;
}


/*
 * PPS output-function code for one SPI instance's frame-sync (SSx).
 *
 * Data-sheet fact, device-#ifdef'd: each arm compiles only where the header defines that
 * instance's SSx output (_RPOUT_SS<n>). The CLC10 50%-FS module uses this to reverse-scan
 * the RPORx registers for the physical pin the board routed FS/SS to.
 */
bool nora_spi_i2s_tdm_hw_get_ss_pps_code( tdm_spi_inst_t inst, uint8_t* code )
{
    if( code == NULL )
    {
        return false;
    }
    switch( inst )
    {
#ifdef _RPOUT_SS1
    case TDM_SPI1: *code = (uint8_t)_RPOUT_SS1; return true;
#endif
#ifdef _RPOUT_SS2
    case TDM_SPI2: *code = (uint8_t)_RPOUT_SS2; return true;
#endif
#ifdef _RPOUT_SS3
    case TDM_SPI3: *code = (uint8_t)_RPOUT_SS3; return true;
#endif
#if (NORA_SPI_I2S_TDM_DSPIC33AK_DEVICE == NORA_SPI_I2S_TDM_DSPIC33AK_DEV_AK512) && defined(_RPOUT_SS4)
    case TDM_SPI4: *code = (uint8_t)_RPOUT_SS4; return true;
#endif
    default: break;
    }
    return false;
}


//===========================================================
// Local Function
//===========================================================

/*
 * True if inst is a silicon SPI instance present on the built device.
 */
static bool hw_inst_valid( tdm_spi_inst_t inst )
{
    return ( (unsigned)inst < (unsigned)TDM_SPI_INST_COUNT );
}


/*
 * Configure and enable one RX or TX DMA channel for a SPI instance.
 *
 * The caller supplies the DMA channel and buffer; the silicon facts table supplies
 * SPIxBUF and the logical DMA trigger. RX copies SPIxBUF into the ping-pong buffer,
 * while TX copies the ping-pong buffer into SPIxBUF.
 */
static bool hw_dma_config_channel( tdm_spi_inst_t inst, nora_dma_channel_t dma_ch, int32_t *buffer, uint32_t count, bool is_rx, uint8_t irq_priority )
{
    if( !hw_inst_valid( inst ) )
    {
        return false;
    }

    const tdm_spi_dev_t *dev = &s_spi_dev[inst];

    const nora_dma_channel_cfg_t cfg =
    {
        .src   = is_rx ? dev->spi_buf : (volatile void *)buffer,  // RX: SPIxBUF / TX: buffer
        .dst   = is_rx ? (volatile void *)buffer : dev->spi_buf,  // RX: buffer / TX: SPIxBUF
        .count = count,

        .src_mode = is_rx ? NORA_DMA_ADDR_FIXED     : NORA_DMA_ADDR_INCREMENT,
        .dst_mode = is_rx ? NORA_DMA_ADDR_INCREMENT : NORA_DMA_ADDR_FIXED,
        .size     = NORA_DMA_SIZE_WORD,             // 32-bit
        .tr_mode  = NORA_DMA_TRMODE_REPEAT_ONESHOT,

        .reload_count = true,
        .reload_src   = !is_rx,   // TX reloads src
        .reload_dst   =  is_rx,   // RX reloads dst

        .half_int_en  = true,
        .done_int_en  = true,

        .trigger      = is_rx ? dev->rx_trigger : dev->tx_trigger,

        .irq_priority_set = true,
        /* Caller-supplied, NOT the PRIO_TDM_DMA constant: the leg owns its priority so that
         * arming re-asserts the rate-monotonic map instead of reverting it. */
        .irq_priority     = irq_priority,
        // RX raises the per-instance block ISR (the block-timing master); TX is
        // interrupt-less -- fire-and-forget ping-pong with auto-reload needs no ISR, so
        // the CPU IRQ is enabled on the RX channel only. (No TX "secondary" handler.)
        .irq_enable       = is_rx,
    };

    if( !nora_dma_channel_config(dma_ch, &cfg) )
    {
        TDM_DBG_PRINTF(" ERROR: DMA ch%u config failed (DMA not ready?).\n", (unsigned)dma_ch);
        return false;
    }
    if( !nora_dma_channel_enable(dma_ch, true) )
    {
        TDM_DBG_PRINTF(" ERROR: DMA ch%u enable failed (DMA not ready?).\n", (unsigned)dma_ch);
        return false;
    }
    return true;
}


/*
 * Enable or disable CPU RX/TX interrupts for one SPI instance.
 *
 * The transport normally keeps these disabled because DMA handles SPI events, but the
 * helper makes that policy explicit for both RX and TX IRQ sources during config/teardown.
 */
static void hw_spi_irq_enable( tdm_spi_inst_t inst, bool enable )
{
    if( !hw_inst_valid( inst ) )
    {
        return;
    }

    hw_spi_irq_bits_enable( inst, enable );
}


