sulaolab/sonora-ak-nano/src/app/hal_spi_i2s_tdm/nora_spi_i2s_tdm_dspic33ak_hw.c
/*
 * Disable and clear CPU SPI interrupt state for one SPI instance.
 *
 * Keeps the "CPU SPI IRQs are not part of the data path" policy in one place.
 */
static void hw_spi_irq_disable_clear( tdm_spi_inst_t inst )
{
    hw_spi_irq_enable( inst, false );
    nora_spi_i2s_tdm_hw_irq_clear_flags( inst );
}


/*
 * CPU RX/TX interrupt flag and enable bits for one SPI instance.
 *
 * Written through the DFP bit aliases with literal values, so each store is a
 * single bset.b / bclr.b.  The enable pair is an if/else rather than
 * `_SPIxRXIE = enable` on purpose: assigning a runtime value to a bit alias
 * compiles to a byte-wide read-modify-write of a register that other peripherals
 * share, which is the hazard being avoided here.  `inst` is a small enum, so the
 * switch also keeps the register and bit compile-time constant per arm.
 */
static void hw_spi_irq_bits_enable( tdm_spi_inst_t inst, bool enable )
{
    switch( inst )
    {
#if defined(_SPI1RXIE) && defined(_SPI1TXIE)
    case TDM_SPI1:
        if( enable ) { _SPI1RXIE = 1; _SPI1TXIE = 1; }
        else         { _SPI1RXIE = 0; _SPI1TXIE = 0; }
        break;
#endif
#if defined(_SPI2RXIE) && defined(_SPI2TXIE)
    case TDM_SPI2:
        if( enable ) { _SPI2RXIE = 1; _SPI2TXIE = 1; }
        else         { _SPI2RXIE = 0; _SPI2TXIE = 0; }
        break;
#endif
#if defined(_SPI3RXIE) && defined(_SPI3TXIE)
    case TDM_SPI3:
        if( enable ) { _SPI3RXIE = 1; _SPI3TXIE = 1; }
        else         { _SPI3RXIE = 0; _SPI3TXIE = 0; }
        break;
#endif
#if (NORA_SPI_I2S_TDM_DSPIC33AK_DEVICE == NORA_SPI_I2S_TDM_DSPIC33AK_DEV_AK512) && defined(_SPI4RXIE) && defined(_SPI4TXIE)
    case TDM_SPI4:
        if( enable ) { _SPI4RXIE = 1; _SPI4TXIE = 1; }
        else         { _SPI4RXIE = 0; _SPI4TXIE = 0; }
        break;
#endif
    default:
        break;
    }
}


static void hw_spi_irq_bits_clear_flags( tdm_spi_inst_t inst )
{
    switch( inst )
    {
#if defined(_SPI1RXIE) && defined(_SPI1TXIE)
    case TDM_SPI1:
        _SPI1RXIF = 0;
        _SPI1TXIF = 0;
        break;
#endif
#if defined(_SPI2RXIE) && defined(_SPI2TXIE)
    case TDM_SPI2:
        _SPI2RXIF = 0;
        _SPI2TXIF = 0;
        break;
#endif
#if defined(_SPI3RXIE) && defined(_SPI3TXIE)
    case TDM_SPI3:
        _SPI3RXIF = 0;
        _SPI3TXIF = 0;
        break;
#endif
#if (NORA_SPI_I2S_TDM_DSPIC33AK_DEVICE == NORA_SPI_I2S_TDM_DSPIC33AK_DEV_AK512) && defined(_SPI4RXIE) && defined(_SPI4TXIE)
    case TDM_SPI4:
        _SPI4RXIF = 0;
        _SPI4TXIF = 0;
        break;
#endif
    default:
        break;
    }
}
